#### [CLUSTER] Terraform Format and Style 🖌`success`
#### [CLUSTER] Terraform Initialization ⚙️`success`
#### [CLUSTER] Terraform Plan 📖`success`
#### [CLUSTER] Terraform Validation 🤖`success`

<details><summary>Show Plan for Cluster</summary>

```

terraform
random_string.suffix: Refreshing state... [id=G2kdpFD9]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0e5c14e1c733c430e]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/sonikro-eks-G2kdpFD9/cluster]
data.aws_availability_zones.available: Reading...
module.eks.data.aws_partition.current: Reading...
aws_kms_key.eks: Refreshing state... [id=c13e585d-98da-4e10-a136-1630c1817c35]
module.eks.module.eks_managed_node_group["runners"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["runners"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["runners"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["runners"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks_managed_node_group["runners"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["runners"].aws_iam_role.this[0]: Refreshing state... [id=runners-eks-node-group-20220521212253124100000001]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0224136af84f90918]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=sonikro-eks-G2kdpFD9-cluster-20220521212253549900000002]
module.eks.module.eks_managed_node_group["runners"].data.aws_caller_identity.current: Read complete after 1s [id=354429752491]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::354429752491:policy/sonikro-eks-G2kdpFD9-cluster-ClusterEncryption20220521212302176400000008]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=sonikro-eks-G2kdpFD9-cluster-20220521212253549900000002-20220521212254461400000007]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=sonikro-eks-G2kdpFD9-cluster-20220521212253549900000002-20220521212254460400000006]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=sonikro-eks-G2kdpFD9-cluster-20220521212253549900000002-20220521212302523500000009]
module.eks.module.eks_managed_node_group["runners"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=runners-eks-node-group-20220521212253124100000001-20220521212254078000000003]
module.eks.module.eks_managed_node_group["runners"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=runners-eks-node-group-20220521212253124100000001-20220521212254143100000004]
module.eks.module.eks_managed_node_group["runners"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=runners-eks-node-group-20220521212253124100000001-20220521212254216800000005]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-060ebad4f2b4b92df]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09fa05258d92a9fa3]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-05ff9cb4ef5a708a5]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0e23653a24720bd82]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-000ef2f596a51e41f]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-045279cad875ae876]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-01aaca47fadffc4ec]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00e180df732d25154]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-01c385365a6de5409]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0f1f5a4ccd9046b5e]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-01874875a07ea03b5]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-06825ec32743deca1]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0a923b88042c5c46c]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-0d98e113eb2974b54]
module.eks.module.eks_managed_node_group["runners"].aws_security_group.this[0]: Refreshing state... [id=sg-0c595f325ceb1fa12]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-05ff9cb4ef5a708a51080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f250df2b1efb2238]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f1b625b6c13fc99f]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-06959a33e03705d69]
module.eks.module.fargate_profile["secondary"].data.aws_partition.current: Reading...
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3915195796]
module.eks.module.fargate_profile["secondary"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-3501121101]
module.eks.module.fargate_profile["secondary"].data.aws_caller_identity.current: Reading...
module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-705439381]
module.eks.module.fargate_profile["default"].data.aws_partition.current: Reading...
module.eks.module.fargate_profile["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.fargate_profile["default"].data.aws_caller_identity.current: Reading...
module.eks.module.fargate_profile["secondary"].data.aws_caller_identity.current: Read complete after 0s [id=354429752491]
module.eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-1657503745]
module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3970695783]
module.eks.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-2272041729]
module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-3722801946]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1845179655]
module.eks.module.fargate_profile["default"].data.aws_caller_identity.current: Read complete after 0s [id=354429752491]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-853208734]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2525318513]
module.eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-2091215625]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2136220288]
module.eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-37441028]
module.eks.module.fargate_profile["secondary"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.fargate_profile["secondary"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=3567408449]
module.eks.module.fargate_profile["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.fargate_profile["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=3567408449]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0bcad471f0492fe7e]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03c0635cc418909e0]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0cb609220f4950caa]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-00e5c71191fa94a3a]
module.eks.module.fargate_profile["secondary"].aws_iam_role.this[0]: Refreshing state... [id=secondary-20220521212307559800000010]
module.eks.module.fargate_profile["default"].aws_iam_role.this[0]: Refreshing state... [id=default-20220521212307981000000011]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=sonikro-eks-G2kdpFD9]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09fa05258d92a9fa31080289494]
module.eks.aws_ec2_tag.cluster_primary_security_group["component"]: Refreshing state... [id=sg-07d5a7c6e6a39680a,component]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::354429752491:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/2E3E6F13A4666C509004DECC5CC4C677]
module.eks.module.eks_managed_node_group["runners"].aws_launch_template.this[0]: Refreshing state... [id=lt-0814ede60729b3f24]
module.eks.module.fargate_profile["secondary"].aws_eks_fargate_profile.this[0]: Refreshing state... [id=sonikro-eks-G2kdpFD9:secondary]
module.eks.module.fargate_profile["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-20220521212307981000000011-20220521212311425000000014]
module.eks.module.fargate_profile["secondary"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"]: Refreshing state... [id=secondary-20220521212307559800000010-20220521212311148300000012]
module.eks.module.fargate_profile["secondary"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=secondary-20220521212307559800000010-20220521212311289600000013]
module.eks.module.fargate_profile["default"].aws_eks_fargate_profile.this[0]: Refreshing state... [id=sonikro-eks-G2kdpFD9:default]
module.eks.module.fargate_profile["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"]: Refreshing state... [id=default-20220521212307981000000011-20220521212311573700000015]
module.eks.module.eks_managed_node_group["runners"].aws_eks_node_group.this[0]: Refreshing state... [id=sonikro-eks-G2kdpFD9:runners-2022052121345157410000001a]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=sonikro-eks-G2kdpFD9:coredns]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=sonikro-eks-G2kdpFD9:kube-proxy]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=sonikro-eks-G2kdpFD9:vpc-cni]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.aws_cloudwatch_log_group.this[0] has been deleted
  - resource "aws_cloudwatch_log_group" "this" {
      - arn               = "arn:aws:logs:us-east-1:354429752491:log-group:/aws/eks/sonikro-eks-G2kdpFD9/cluster" -> null
        id                = "/aws/eks/sonikro-eks-G2kdpFD9/cluster"
      - name              = "/aws/eks/sonikro-eks-G2kdpFD9/cluster" -> null
        tags              = {
            "component" = "sonikro-eks"
        }
        # (2 unchanged attributes hidden)
    }

  # module.eks.aws_eks_addon.this["coredns"] has been deleted
  - resource "aws_eks_addon" "this" {
      - addon_name        = "coredns" -> null
      - addon_version     = "v1.8.7-eksbuild.1" -> null
      - arn               = "arn:aws:eks:us-east-1:354429752491:addon/sonikro-eks-G2kdpFD9/coredns/96c07447-a67f-e7cc-6ec4-027e45ed0166" -> null
      - cluster_name      = "sonikro-eks-G2kdpFD9" -> null
      - created_at        = "2022-05-21T21:39:07Z" -> null
      - id                = "sonikro-eks-G2kdpFD9:coredns" -> null
      - modified_at       = "2022-05-21T21:39:14Z" -> null
      - resolve_conflicts = "OVERWRITE" -> null
      - tags              = {
          - "component" = "sonikro-eks"
        } -> null
      - tags_all          = {
          - "component" = "sonikro-eks"
        } -> null
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] has been deleted
  - resource "aws_eks_addon" "this" {
      - addon_name    = "kube-proxy" -> null
      - addon_version = "v1.22.6-eksbuild.1" -> null
      - arn           = "arn:aws:eks:us-east-1:354429752491:addon/sonikro-eks-G2kdpFD9/kube-proxy/bcc07447-a67c-c937-923c-17fe27a972cf" -> null
      - cluster_name  = "sonikro-eks-G2kdpFD9" -> null
      - created_at    = "2022-05-21T21:39:07Z" -> null
      - id            = "sonikro-eks-G2kdpFD9:kube-proxy" -> null
      - modified_at   = "2022-05-21T21:39:08Z" -> null
      - tags          = {
          - "component" = "sonikro-eks"
        } -> null
      - tags_all      = {
          - "component" = "sonikro-eks"
        } -> null
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] has been deleted
  - resource "aws_eks_addon" "this" {
      - addon_name        = "vpc-cni" -> null
      - addon_version     = "v1.10.1-eksbuild.1" -> null
      - arn               = "arn:aws:eks:us-east-1:354429752491:addon/sonikro-eks-G2kdpFD9/vpc-cni/ccc07447-a681-9b2a-5d7e-f97456dcd1ba" -> null
      - cluster_name      = "sonikro-eks-G2kdpFD9" -> null
      - created_at        = "2022-05-21T21:39:07Z" -> null
      - id                = "sonikro-eks-G2kdpFD9:vpc-cni" -> null
      - modified_at       = "2022-05-21T21:39:38Z" -> null
      - resolve_conflicts = "OVERWRITE" -> null
      - tags              = {
          - "component" = "sonikro-eks"
        } -> null
      - tags_all          = {
          - "component" = "sonikro-eks"
        } -> null
    }

  # module.eks.aws_eks_cluster.this[0] has been deleted
  - resource "aws_eks_cluster" "this" {
      - arn                       = "arn:aws:eks:us-east-1:354429752491:cluster/sonikro-eks-G2kdpFD9" -> null
      ~ certificate_authority     = [
          ~ {
              ~ data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvakNDQWVhZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1EVXlNVEl4TWprek1Wb1hEVE15TURVeE9ESXhNamt6TVZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTFZZCnBhQ1MvTUJKR0l5c280SStEaGZQcW5JcHUzZ3ZqdFM2L3E2MWtVVm9qVklFdnlVeXppZnl5eFRjY1pnaDBOY28KblhlU3Y3OFAvZU9VZGxlNFVEc3ArR3VveTdURmkrejd6YzMycHdDVi9HTWR0NkZpZ2NrNzlBVFVtN1JBbWdIcgpoblZMMWVFVVJiNWRhY2FRamxieGRVQUhRdy9ONk1NNXBxcjYxdXQxQWc2R0QrT1ZYQk1kRC9xbGhQU2NqM2MwCmttQlM4TklwaW5UYXBBbXlpUThYQWJKN05Va0dyQWdQSmpmcmtuOFExZS9GVzE2d3ZXRlhaRWhMV0YwdFRmb1IKbEJOK3YzVktGQWtMajVlZFpFWjIzbXZCdjZCdWZ3R2tIOWRUbCtwQUlQb2cyQXMvNUdSNDFuL3pZL2RVNldacwpXOU5ycUcrMVVIOC83bXdBYnkwQ0F3RUFBYU5aTUZjd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZDekhySURGcTlJVFFOT1JhNXVLa2l0SldTdWZNQlVHQTFVZEVRUU8KTUF5Q0NtdDFZbVZ5Ym1WMFpYTXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBRXdSUFY1dnJ6dWNTRFgvOUNEUgpSYTlCb2cvalB3cUlVTTkzZlBWMDBmRHVrcm44cTBjaU1qOEM5OTZNTkgweENHLzlxWWF4VHZhMUtMRFZxeERXCnQ0UFRHeHNaTXV2WGpsWVFuelpKaXpyNFVsS0orZUtJUWdRY0RURGxjWmYxSVFYZkZEMHdsNGJKRTh0ZG9GVi8Kc1cvb0ZpMGNScXAyRzMzN1VNOVJhTEFsRHZTTmUwb3pMbmg5Y2RFOWVGZlFEQ0RWMVAxTXVDUGhUd3RKUm15LwpDZThNOXFwaDVMSE1mUTRQQnNlTS93VjdVdm84ejBOeDJ4TURKM1N0YTIrcXpvQW5Tb1FVRUNPS2lmQldTeDRDCjFFMHZpY1NGc0FncU1RZGI2MkFPL3RXUWF3WVUvOFhmQ3ZkbC96cU4zbi8yKzk3VXQvUXl0KzcwS0ttU0RpNGMKVW9jPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> null
            },
        ]
      - endpoint                  = "https://2E3E6F13A4666C509004DECC5CC4C677.gr7.us-east-1.eks.amazonaws.com" -> null
      - id                        = "sonikro-eks-G2kdpFD9" -> null
      ~ identity                  = [
          ~ {
              ~ oidc = [
                  ~ {
                      ~ issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/2E3E6F13A4666C509004DECC5CC4C677" -> null
                    },
                ]
            },
        ]
      - name                      = "sonikro-eks-G2kdpFD9" -> null
      - platform_version          = "eks.1" -> null
      - status                    = "ACTIVE" -> null
        tags                      = {
            "component" = "sonikro-eks"
        }
      - version                   = "1.22" -> null
        # (4 unchanged attributes hidden)




      ~ vpc_config {
          - cluster_security_group_id = "sg-07d5a7c6e6a39680a" -> null
            # (6 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] has been deleted
  - resource "aws_iam_openid_connect_provider" "oidc_provider" {
      - arn             = "arn:aws:iam::354429752491:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/2E3E6F13A4666C509004DECC5CC4C677" -> null
        id              = "arn:aws:iam::354429752491:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/2E3E6F13A4666C509004DECC5CC4C677"
        tags            = {
            "Name"      = "sonikro-eks-G2kdpFD9-eks-irsa"
            "component" = "sonikro-eks"
        }
        # (4 unchanged attributes hidden)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] has been deleted
  - resource "aws_iam_policy" "cluster_encryption" {
      - arn         = "arn:aws:iam::354429752491:policy/sonikro-eks-G2kdpFD9-cluster-ClusterEncryption20220521212302176400000008" -> null
        id          = "arn:aws:iam::354429752491:policy/sonikro-eks-G2kdpFD9-cluster-ClusterEncryption20220521212302176400000008"
        name        = "sonikro-eks-G2kdpFD9-cluster-ClusterEncryption20220521212302176400000008"
        tags        = {
            "component" = "sonikro-eks"
        }
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role.this[0] has been deleted
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::354429752491:role/sonikro-eks-G2kdpFD9-cluster-20220521212253549900000002" -> null
        id                    = "sonikro-eks-G2kdpFD9-cluster-20220521212253549900000002"
      - name                  = "sonikro-eks-G2kdpFD9-cluster-20220521212253549900000002" -> null
        tags                  = {
            "component" = "sonikro-eks"
        }
      - unique_id             = "AROAVFBNI2SVW77YKLZA2" -> null
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_security_group.cluster[0] has been deleted
  - resource "aws_security_group" "cluster" {
      - arn                    = "arn:aws:ec2:us-east-1:354429752491:security-group/sg-06825ec32743deca1" -> null
      - id                     = "sg-06825ec32743deca1" -> null
        name                   = "sonikro-eks-G2kdpFD9-cluster-2022052121230584490000000d"
        tags                   = {
            "Name"      = "sonikro-eks-G2kdpFD9-cluster"
            "component" = "sonikro-eks"
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.node[0] has been deleted
  - resource "aws_security_group" "node" {
      - arn                    = "arn:aws:ec2:us-east-1:354429752491:security-group/sg-0a923b88042c5c46c" -> null
      - id                     = "sg-0a923b88042c5c46c" -> null
        name                   = "sonikro-eks-G2kdpFD9-node-2022052121230598150000000e"
        tags                   = {
            "Name"                                       = "sonikro-eks-G2kdpFD9-node"
            "component"                                  = "sonikro-eks"
            "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "owned"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[0] has changed
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0224136af84f90918"
      ~ tags                 = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all             = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] has changed
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-000ef2f596a51e41f"
      ~ tags     = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] has changed
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-0bcad471f0492fe7e"
      ~ tags                 = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all             = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-09fa05258d92a9fa3"
      ~ tags             = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-05ff9cb4ef5a708a5"
      ~ tags             = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] has changed
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-060ebad4f2b4b92df"
      ~ tags                                           = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] has changed
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-045279cad875ae876"
      ~ tags                                           = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] has changed
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0e23653a24720bd82"
      ~ tags                                           = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] has changed
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-01c385365a6de5409"
      ~ tags                                           = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] has changed
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-00e180df732d25154"
      ~ tags                                           = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] has changed
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0f1f5a4ccd9046b5e"
      ~ tags                                           = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] has changed
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-0e5c14e1c733c430e"
      ~ tags                             = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all                         = {
          + "kubernetes.io/cluster/sonikro-eks"          = "shared"
          - "kubernetes.io/cluster/sonikro-eks-G2kdpFD9" = "shared" -> null
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["runners"].aws_eks_node_group.this[0] has been deleted
  - resource "aws_eks_node_group" "this" {
      - arn                    = "arn:aws:eks:us-east-1:354429752491:nodegroup/sonikro-eks-G2kdpFD9/runners-2022052121345157410000001a/cac07445-b3a7-02f4-2b76-b4cda27f2924" -> null
      - id                     = "sonikro-eks-G2kdpFD9:runners-2022052121345157410000001a" -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-runners-2022052121345157410000001a-cac07445-b3a7-02f4-2b76-b4cda27f2924"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> null
        tags                   = {
            "Name"      = "runners"
            "component" = "sonikro-eks"
        }
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["runners"].aws_launch_template.this[0] has changed
  ~ resource "aws_launch_template" "this" {
      ~ default_version         = 1 -> 2
        id                      = "lt-0814ede60729b3f24"
      ~ latest_version          = 1 -> 2
        name                    = "runners-20220521213450953500000018"
        tags                    = {
            "component" = "sonikro-eks"
        }
        # (8 unchanged attributes hidden)



        # (5 unchanged blocks hidden)
    }

  # module.eks.module.fargate_profile["default"].aws_eks_fargate_profile.this[0] has been deleted
  - resource "aws_eks_fargate_profile" "this" {
      - arn                    = "arn:aws:eks:us-east-1:354429752491:fargateprofile/sonikro-eks-G2kdpFD9/default/c6c07446-70e7-66b0-f66f-d8b6eb1a4fb5" -> null
      - id                     = "sonikro-eks-G2kdpFD9:default" -> null
      - pod_execution_role_arn = "arn:aws:iam::354429752491:role/default-20220521212307981000000011" -> null
      - status                 = "ACTIVE" -> null
        tags                   = {
            "Owner"     = "default"
            "component" = "sonikro-eks"
        }
        # (4 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # module.eks.module.fargate_profile["secondary"].aws_eks_fargate_profile.this[0] has been deleted
  - resource "aws_eks_fargate_profile" "this" {
      - arn                    = "arn:aws:eks:us-east-1:354429752491:fargateprofile/sonikro-eks-G2kdpFD9/secondary/e8c07445-b26c-6dd7-9237-f42c83ac0940" -> null
      - id                     = "sonikro-eks-G2kdpFD9:secondary" -> null
      - pod_execution_role_arn = "arn:aws:iam::354429752491:role/secondary-20220521212307559800000010" -> null
      - status                 = "ACTIVE" -> null
        tags                   = {
            "Owner"     = "secondary"
            "component" = "sonikro-eks"
        }
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

�────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster" {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # random_string.suffix will be destroyed
  # (because random_string.suffix is not in configuration)
  - resource "random_string" "suffix" {
      - id          = "G2kdpFD9" -> null
      - length      = 8 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = "G2kdpFD9" -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/sonikro-eks/cluster"
      + retention_in_days = 90
      + tags              = {
          + "component" = "sonikro-eks"
        }
      + tags_all          = {
          + "component" = "sonikro-eks"
        }
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["component"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "component"
      + resource_id = (known after apply)
      + value       = "sonikro-eks"
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name        = "coredns"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = "sonikro-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags              = {
          + "component" = "sonikro-eks"
        }
      + tags_all          = {
          + "component" = "sonikro-eks"
        }
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name    = "kube-proxy"
      + addon_version = (known after apply)
      + arn           = (known after apply)
      + cluster_name  = "sonikro-eks"
      + created_at    = (known after apply)
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + tags          = {
          + "component" = "sonikro-eks"
        }
      + tags_all      = {
          + "component" = "sonikro-eks"
        }
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name        = "vpc-cni"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = "sonikro-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags              = {
          + "component" = "sonikro-eks"
        }
      + tags_all          = {
          + "component" = "sonikro-eks"
        }
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "sonikro-eks"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "component" = "sonikro-eks"
        }
      + tags_all                  = {
          + "component" = "sonikro-eks"
        }
      + version                   = "1.22"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = "arn:aws:kms:us-east-1:354429752491:key/c13e585d-98da-4e10-a136-1630c1817c35"
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-045279cad875ae876",
              + "subnet-060ebad4f2b4b92df",
              + "subnet-0e23653a24720bd82",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name"      = "sonikro-eks-eks-irsa"
          + "component" = "sonikro-eks"
        }
      + tags_all        = {
          + "Name"      = "sonikro-eks-eks-irsa"
          + "component" = "sonikro-eks"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn         = (known after apply)
      + description = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "sonikro-eks-cluster-ClusterEncryption"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ListGrants",
                          + "kms:DescribeKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:kms:us-east-1:354429752491:key/c13e585d-98da-4e10-a136-1630c1817c35",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "component" = "sonikro-eks"
        }
      + tags_all    = {
          + "component" = "sonikro-eks"
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "sonikro-eks-cluster-"
      + path                  = "/"
      + tags                  = {
          + "component" = "sonikro-eks"
        }
      + tags_all              = {
          + "component" = "sonikro-eks"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "sonikro-eks-cluster"
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "sonikro-eks-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"      = "sonikro-eks-cluster"
          + "component" = "sonikro-eks"
        }
      + tags_all               = {
          + "Name"      = "sonikro-eks-cluster"
          + "component" = "sonikro-eks"
        }
      + vpc_id                 = "vpc-0e5c14e1c733c430e"
    }

  # module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "sonikro-eks-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                              = "sonikro-eks-node"
          + "component"                         = "sonikro-eks"
          + "kubernetes.io/cluster/sonikro-eks" = "owned"
        }
      + tags_all               = {
          + "Name"                              = "sonikro-eks-node"
          + "component"                         = "sonikro-eks"
          + "kubernetes.io/cluster/sonikro-eks" = "owned"
        }
      + vpc_id                 = "vpc-0e5c14e1c733c430e"
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_https"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress all HTTPS to internet"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/TCP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/UDP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.module.eks_managed_node_group["runners"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "sonikro-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.large",
        ]
      + labels                 = {
          + "component" = "sonikro-eks"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "runners-"
      + node_role_arn          = "arn:aws:iam::354429752491:role/runners-eks-node-group-20220521212253124100000001"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-045279cad875ae876",
          + "subnet-060ebad4f2b4b92df",
          + "subnet-0e23653a24720bd82",
        ]
      + tags                   = {
          + "Name"      = "runners"
          + "component" = "sonikro-eks"
        }
      + tags_all               = {
          + "Name"      = "runners"
          + "component" = "sonikro-eks"
        }
      + version                = "1.22"

      + launch_template {
          + id      = (known after apply)
          + name    = "runners-20220521213450953500000018"
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["runners"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version         = 2 -> (known after apply)
        id                      = "lt-0814ede60729b3f24"
      ~ latest_version          = 2 -> (known after apply)
        name                    = "runners-20220521213450953500000018"
        tags                    = {
            "component" = "sonikro-eks"
        }
      ~ vpc_security_group_ids  = [
          - "sg-0c595f325ceb1fa12",
          - "sg-0d9bd3c8c66d99c77",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)



        # (5 unchanged blocks hidden)
    }

  # module.eks.module.fargate_profile["default"].aws_eks_fargate_profile.this[0] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = "sonikro-eks"
      + fargate_profile_name   = "default"
      + id                     = (known after apply)
      + pod_execution_role_arn = "arn:aws:iam::354429752491:role/default-20220521212307981000000011"
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-045279cad875ae876",
          + "subnet-060ebad4f2b4b92df",
          + "subnet-0e23653a24720bd82",
        ]
      + tags                   = {
          + "Owner"     = "default"
          + "component" = "sonikro-eks"
        }
      + tags_all               = {
          + "Owner"     = "default"
          + "component" = "sonikro-eks"
        }

      + selector {
          + labels    = {
              + "Application" = "backend"
            }
          + namespace = "backend"
        }
      + selector {
          + labels    = {
              + "WorkerType" = "fargate"
            }
          + namespace = "default"
        }

      + timeouts {
          + create = "20m"
          + delete = "20m"
        }
    }

  # module.eks.module.fargate_profile["secondary"].aws_eks_fargate_profile.this[0] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = "sonikro-eks"
      + fargate_profile_name   = "secondary"
      + id                     = (known after apply)
      + pod_execution_role_arn = "arn:aws:iam::354429752491:role/secondary-20220521212307559800000010"
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-045279cad875ae876",
        ]
      + tags                   = {
          + "Owner"     = "secondary"
          + "component" = "sonikro-eks"
        }
      + tags_all               = {
          + "Owner"     = "secondary"
          + "component" = "sonikro-eks"
        }

      + selector {
          + labels    = {
              + "component" = "sonikro-eks"
            }
          + namespace = "default"
        }

      + timeouts {}
    }

Plan: 30 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ aws_auth_configmap_yaml                         = <<-EOT
        apiVersion: v1
        kind: ConfigMap
        metadata:
          name: aws-auth
          namespace: kube-system
        data:
          mapRoles: |
            - rolearn: arn:aws:iam::354429752491:role/runners-eks-node-group-20220521212253124100000001
              username: system:node:{{EC2PrivateDNSName}}
              groups:
                - system:bootstrappers
                - system:nodes
            - rolearn: arn:aws:iam::354429752491:role/default-20220521212307981000000011
              username: system:node:{{SessionName}}
              groups:
                - system:bootstrappers
                - system:nodes
                - system:node-proxier
            - rolearn: arn:aws:iam::354429752491:role/secondary-20220521212307559800000010
              username: system:node:{{SessionName}}
              groups:
                - system:bootstrappers
                - system:nodes
                - system:node-proxier
    EOT
  ~ cloudwatch_log_group_arn                        = "arn:aws:logs:us-east-1:354429752491:log-group:/aws/eks/sonikro-eks-G2kdpFD9/cluster" -> (known after apply)
  ~ cloudwatch_log_group_name                       = "/aws/eks/sonikro-eks-G2kdpFD9/cluster" -> "/aws/eks/sonikro-eks/cluster"
  ~ cluster_addons                                  = {
      ~ coredns    = {
          ~ addon_version            = "v1.8.7-eksbuild.1" -> (known after apply)
          ~ arn                      = "arn:aws:eks:us-east-1:354429752491:addon/sonikro-eks-G2kdpFD9/coredns/96c07447-a67f-e7cc-6ec4-027e45ed0166" -> (known after apply)
          ~ cluster_name             = "sonikro-eks-G2kdpFD9" -> "sonikro-eks"
          ~ created_at               = "2022-05-21T21:39:07Z" -> (known after apply)
          ~ id                       = "sonikro-eks-G2kdpFD9:coredns" -> (known after apply)
          ~ modified_at              = "2022-05-21T21:39:14Z" -> (known after apply)
          ~ service_account_role_arn = "" -> null
            tags                     = {
                "component" = "sonikro-eks"
            }
            # (4 unchanged elements hidden)
        }
      ~ kube-proxy = {
          ~ addon_version            = "v1.22.6-eksbuild.1" -> (known after apply)
          ~ arn                      = "arn:aws:eks:us-east-1:354429752491:addon/sonikro-eks-G2kdpFD9/kube-proxy/bcc07447-a67c-c937-923c-17fe27a972cf" -> (known after apply)
          ~ cluster_name             = "sonikro-eks-G2kdpFD9" -> "sonikro-eks"
          ~ created_at               = "2022-05-21T21:39:07Z" -> (known after apply)
          ~ id                       = "sonikro-eks-G2kdpFD9:kube-proxy" -> (known after apply)
          ~ modified_at              = "2022-05-21T21:39:08Z" -> (known after apply)
          ~ service_account_role_arn = "" -> null
            tags                     = {
                "component" = "sonikro-eks"
            }
            # (4 unchanged elements hidden)
        }
      ~ vpc-cni    = {
          ~ addon_version            = "v1.10.1-eksbuild.1" -> (known after apply)
          ~ arn                      = "arn:aws:eks:us-east-1:354429752491:addon/sonikro-eks-G2kdpFD9/vpc-cni/ccc07447-a681-9b2a-5d7e-f97456dcd1ba" -> (known after apply)
          ~ cluster_name             = "sonikro-eks-G2kdpFD9" -> "sonikro-eks"
          ~ created_at               = "2022-05-21T21:39:07Z" -> (known after apply)
          ~ id                       = "sonikro-eks-G2kdpFD9:vpc-cni" -> (known after apply)
          ~ modified_at              = "2022-05-21T21:39:38Z" -> (known after apply)
          ~ service_account_role_arn = "" -> null
            tags                     = {
                "component" = "sonikro-eks"
            }
            # (4 unchanged elements hidden)
        }
    }
  ~ cluster_arn                                     = "arn:aws:eks:us-east-1:354429752491:cluster/sonikro-eks-G2kdpFD9" -> (known after apply)
  ~ cluster_certificate_authority_data              = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvakNDQWVhZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1EVXlNVEl4TWprek1Wb1hEVE15TURVeE9ESXhNamt6TVZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTFZZCnBhQ1MvTUJKR0l5c280SStEaGZQcW5JcHUzZ3ZqdFM2L3E2MWtVVm9qVklFdnlVeXppZnl5eFRjY1pnaDBOY28KblhlU3Y3OFAvZU9VZGxlNFVEc3ArR3VveTdURmkrejd6YzMycHdDVi9HTWR0NkZpZ2NrNzlBVFVtN1JBbWdIcgpoblZMMWVFVVJiNWRhY2FRamxieGRVQUhRdy9ONk1NNXBxcjYxdXQxQWc2R0QrT1ZYQk1kRC9xbGhQU2NqM2MwCmttQlM4TklwaW5UYXBBbXlpUThYQWJKN05Va0dyQWdQSmpmcmtuOFExZS9GVzE2d3ZXRlhaRWhMV0YwdFRmb1IKbEJOK3YzVktGQWtMajVlZFpFWjIzbXZCdjZCdWZ3R2tIOWRUbCtwQUlQb2cyQXMvNUdSNDFuL3pZL2RVNldacwpXOU5ycUcrMVVIOC83bXdBYnkwQ0F3RUFBYU5aTUZjd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZDekhySURGcTlJVFFOT1JhNXVLa2l0SldTdWZNQlVHQTFVZEVRUU8KTUF5Q0NtdDFZbVZ5Ym1WMFpYTXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBRXdSUFY1dnJ6dWNTRFgvOUNEUgpSYTlCb2cvalB3cUlVTTkzZlBWMDBmRHVrcm44cTBjaU1qOEM5OTZNTkgweENHLzlxWWF4VHZhMUtMRFZxeERXCnQ0UFRHeHNaTXV2WGpsWVFuelpKaXpyNFVsS0orZUtJUWdRY0RURGxjWmYxSVFYZkZEMHdsNGJKRTh0ZG9GVi8Kc1cvb0ZpMGNScXAyRzMzN1VNOVJhTEFsRHZTTmUwb3pMbmg5Y2RFOWVGZlFEQ0RWMVAxTXVDUGhUd3RKUm15LwpDZThNOXFwaDVMSE1mUTRQQnNlTS93VjdVdm84ejBOeDJ4TURKM1N0YTIrcXpvQW5Tb1FVRUNPS2lmQldTeDRDCjFFMHZpY1NGc0FncU1RZGI2MkFPL3RXUWF3WVUvOFhmQ3ZkbC96cU4zbi8yKzk3VXQvUXl0KzcwS0ttU0RpNGMKVW9jPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
  ~ cluster_endpoint                                = "https://2E3E6F13A4666C509004DECC5CC4C677.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
  ~ cluster_iam_role_arn                            = "arn:aws:iam::354429752491:role/sonikro-eks-G2kdpFD9-cluster-20220521212253549900000002" -> (known after apply)
  ~ cluster_iam_role_name                           = "sonikro-eks-G2kdpFD9-cluster-20220521212253549900000002" -> (known after apply)
  ~ cluster_iam_role_unique_id                      = "AROAVFBNI2SVW77YKLZA2" -> (known after apply)
  ~ cluster_id                                      = "sonikro-eks-G2kdpFD9" -> (known after apply)
  ~ cluster_oidc_issuer_url                         = "https://oidc.eks.us-east-1.amazonaws.com/id/2E3E6F13A4666C509004DECC5CC4C677" -> (known after apply)
  ~ cluster_platform_version                        = "eks.1" -> (known after apply)
  ~ cluster_primary_security_group_id               = "sg-07d5a7c6e6a39680a" -> (known after apply)
  ~ cluster_security_group_arn                      = "arn:aws:ec2:us-east-1:354429752491:security-group/sg-06825ec32743deca1" -> (known after apply)
  ~ cluster_security_group_id                       = "sg-06825ec32743deca1" -> (known after apply)
  ~ cluster_status                                  = "ACTIVE" -> (known after apply)
  ~ eks_managed_node_groups                         = {
      ~ runners = {
          ~ launch_template_latest_version     = 1 -> (known after apply)
          ~ node_group_arn                     = "arn:aws:eks:us-east-1:354429752491:nodegroup/sonikro-eks-G2kdpFD9/runners-2022052121345157410000001a/cac07445-b3a7-02f4-2b76-b4cda27f2924" -> (known after apply)
          ~ node_group_autoscaling_group_names = [
              - "eks-runners-2022052121345157410000001a-cac07445-b3a7-02f4-2b76-b4cda27f2924",
            ] -> (known after apply)
          ~ node_group_id                      = "sonikro-eks-G2kdpFD9:runners-2022052121345157410000001a" -> (known after apply)
          ~ node_group_resources               = [
              - {
                  - autoscaling_groups              = [
                      - {
                          - name = "eks-runners-2022052121345157410000001a-cac07445-b3a7-02f4-2b76-b4cda27f2924"
                        },
                    ]
                  - remote_access_security_group_id = ""
                },
            ] -> (known after apply)
          ~ node_group_status                  = "arn:aws:eks:us-east-1:354429752491:nodegroup/sonikro-eks-G2kdpFD9/runners-2022052121345157410000001a/cac07445-b3a7-02f4-2b76-b4cda27f2924" -> (known after apply)
            # (7 unchanged elements hidden)
        }
    }
  ~ eks_managed_node_groups_autoscaling_group_names = [
      - "eks-runners-2022052121345157410000001a-cac07445-b3a7-02f4-2b76-b4cda27f2924",
    ] -> (known after apply)
  ~ fargate_profiles                                = {
      ~ default   = {
          ~ fargate_profile_arn                    = "arn:aws:eks:us-east-1:354429752491:fargateprofile/sonikro-eks-G2kdpFD9/default/c6c07446-70e7-66b0-f66f-d8b6eb1a4fb5" -> (known after apply)
          ~ fargate_profile_id                     = "sonikro-eks-G2kdpFD9:default" -> (known after apply)
          ~ fargate_profile_status                 = "ACTIVE" -> (known after apply)
            # (4 unchanged elements hidden)
        }
      ~ secondary = {
          ~ fargate_profile_arn                    = "arn:aws:eks:us-east-1:354429752491:fargateprofile/sonikro-eks-G2kdpFD9/secondary/e8c07445-b26c-6dd7-9237-f42c83ac0940" -> (known after apply)
          ~ fargate_profile_id                     = "sonikro-eks-G2kdpFD9:secondary" -> (known after apply)
          ~ fargate_profile_status                 = "ACTIVE" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }
  ~ node_security_group_arn                         = "arn:aws:ec2:us-east-1:354429752491:security-group/sg-0a923b88042c5c46c" -> (known after apply)
  ~ node_security_group_id                          = "sg-0a923b88042c5c46c" -> (known after apply)
  ~ oidc_provider                                   = "oidc.eks.us-east-1.amazonaws.com/id/2E3E6F13A4666C509004DECC5CC4C677" -> (known after apply)
  ~ oidc_provider_arn                               = "arn:aws:iam::354429752491:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/2E3E6F13A4666C509004DECC5CC4C677" -> (known after apply)

Warning: Redundant ignore_changes element

  on .terraform/modules/eks/main.tf line 305, in resource "aws_eks_addon" "this":
 305: resource "aws_eks_addon" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute modified_at is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

�────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sonikro, Action: `pull_request`*